
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/a-itabashi/aws-ecs-terraform/actions/runs/14151555371)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01d2f3607d1897c0b]
aws_security_group.alb: Refreshing state... [id=sg-012c8de90de2f8baf]
aws_security_group.ecs: Refreshing state... [id=sg-041f8ed7691d70ce5]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-005b54589c2b6da5f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e65c15767a8f3803]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a0d641cf5155989]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08a9a127f143f34c0]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9f484e26ad70778]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04a005e3c981f9801]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06c8865a563239fd1]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ecb407aff77341b6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09569d2eb812a2f7d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0459a6c028894452a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-030a489d8399a107a]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-844562651]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-018ff3bbcd43e1f97]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f4ab1a1c01510657]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094ec60ad1531eeb5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e182b46e28a84380]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:loadbalancer/app/go-simple-server-alb/ae567f9e14a6567d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04a005e3c981f98011080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab9ee2a722845733]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2656be80ccf73b5]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-04ba37f781522f10e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d6b7549b076f2d9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0459a6c028894452a1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-030a489d8399a107a1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener-rule/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee/1c3d616d3793774e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"bc6f017b7fd4df769a4a8e78eb75855ee934ff19","Vars":{},"WorkflowName":"Terraform"} -->